system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sclsVOFFoamsf;

startFrom       startTime;
startTime       0;

stopAt          endTime;

endTime         3;

deltaT          0.00008077;  // dT= h/16 

writeControl    adjustableRunTime;

writeInterval   0.005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1;
maxAlphaCo      1;

maxDeltaT       1e-3;

functions
{
    probes
    {
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );

        type            probes;

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        outputControl   timeStep;//outputTime;
        outputInterval  1;

        // Fields to be probed
        fields
        (
            p 
	    U
        );

        probeLocations
        (
            (0.120 0.070 0)  // p1
            (0.120 0.040 0)  // p2
            (0.120 0.030 0)  // p3
            (0.150 0.040 0)  // P4
            (0.150 0.010 0)  // P5 
            (0.180 0.010 0)  // P6
	);
    }
}

// ************************************************************************* //
